wegam/STM32F10xUSBW/FWLIB/Lib/Protocol/USART_ISP.C
}

/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序；读数据分五步：1-读数据命令，2-读数据起始地址，3-需要读取的长度，4-读数据过程，5-上报数据
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_ReadMemory(ISP_Conf_TypeDef *ISP_Conf)		//ISP读数据（从机->主机）
{	
	if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitRData)				//ISP等待读数据操作
	{
		//*******************执行读数据操作
		#ifdef	Usart_ISP_Simulation 		//模拟从机
		{
			ISP_Conf->ISP_DATA.ISP_TxBuffer[0]=0x79;
			memcpy(&ISP_Conf->ISP_DATA.ISP_TxBuffer[1], ISP_Conf->ISP_DATA.ISP_TvBuffer, ISP_Conf->ISP_DATA.ReadLen+1);	//复制数据
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitSData;		//ISP等待发送数据			
		}
		#else
		{
			//*******************
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitReaded;		//ISP等待读读数完成
		}
		#endif		
	}
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitReaded)	//ISP等待读读数完成
	{
		//*******************等待数据读取完成，数据读取完成后发送数据，然后等待发送完成
//		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitSended;		//ISP等待数据上传完成
	}
//	unsigned short Wlen=ISP_Conf->ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
//	unsigned char Bcc=BCC8(ISP_Conf->ISP_RvBuffer,Wlen+2);		//异或校验;
//	if(Bcc!=ISP_Conf->ISP_RvBuffer[Wlen+2])
//	{
//		return;
//	}
//	ISP_Conf->ISP_STATUS=ISP_STATUS_WRITE;		//FLASH执行写操作
//	memcpy(ISP_Conf->ISP_TvBuffer, &ISP_Conf->ISP_RvBuffer[1], Wlen+1);
//	Usart_ISP_ACK(ISP_Conf);						//ISP应答
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_WriteMemory(ISP_Conf_TypeDef *ISP_Conf)	//ISP写数据（主机->从机）写数据时，传完地址后等待传入数据，再执行写操作
{	
	#ifdef	Usart_ISP_Simulation 		//模拟从机
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWData)		//ISP等待接收待写入数据
		{
			unsigned short Wlen=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
			unsigned char Bcc=BCC8(ISP_Conf->ISP_DATA.ISP_RvBuffer,Wlen+2);		//异或校验;
			if(Bcc!=ISP_Conf->ISP_DATA.ISP_RvBuffer[Wlen+2])
			{
				return;
			}
			memcpy(ISP_Conf->ISP_DATA.ISP_TvBuffer, &ISP_Conf->ISP_DATA.ISP_RvBuffer[1], Wlen+1);	//复制数据
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitWrited;				//ISP等待写入完成
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWrited)	//ISP等待写入完成
		{
			Usart_ISP_ACK(ISP_Conf);	//ISP应答
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitCommand;				//ISP等待命令（作为从机)
		}
	}
	#else
	{
	}
	#endif
//	unsigned short Wlen=ISP_Conf->ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
//	unsigned char Bcc=BCC8(ISP_Conf->ISP_RvBuffer,Wlen+2);		//异或校验;
//	if(Bcc!=ISP_Conf->ISP_RvBuffer[Wlen+2])
//	{
//		return;
//	}
//	ISP_Conf->ISP_STATUS=ISP_STATUS_WRITE;		//FLASH执行写操作
//	memcpy(ISP_Conf->ISP_TvBuffer, &ISP_Conf->ISP_RvBuffer[1], Wlen+1);
//	Usart_ISP_ACK(ISP_Conf);						//ISP应答
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SendBuffer(ISP_Conf_TypeDef *ISP_Conf)	//ISP上传数据（从机->主机)
{	
	if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitSData)
	{
//		ISP_Conf->ISP_DATA.ISP_TxBuffer[0]=0x79;
//		memcpy(&ISP_Conf->ISP_DATA.ISP_TxBuffer[1], ISP_Conf->ISP_DATA.ISP_TvBuffer, ISP_Conf->ISP_DATA.ReadLen);	//复制数据
		USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_TxBuffer,ISP_Conf->ISP_DATA.ReadLen+2);				//串口DMA发送程序
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitSended;				//等待新的命令
	}
	else	if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitSended)
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitCommand;				//等待新的命令
	}
	
//	unsigned short Wlen=ISP_Conf->ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
//	unsigned char Bcc=BCC8(ISP_Conf->ISP_RvBuffer,Wlen+2);		//异或校验;
//	if(Bcc!=ISP_Conf->ISP_RvBuffer[Wlen+2])
//	{
//		return;
//	}
//	ISP_Conf->ISP_STATUS=ISP_STATUS_WRITE;		//FLASH执行写操作
//	memcpy(ISP_Conf->ISP_TvBuffer, &ISP_Conf->ISP_RvBuffer[1], Wlen+1);
//	Usart_ISP_ACK(ISP_Conf);						//ISP应答
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CheckFun
* 功能描述		:	检测ISP模块工作模式---空闲时检测
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Erase(ISP_Conf_TypeDef *ISP_Conf)				//ISP擦除操作，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）等待擦除完成，完成后应答
{
	//ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased
	#ifdef	Usart_ISP_Simulation 		//模拟从机
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase)	//开始擦除
		{
			if(ISP_Conf->ISP_DATA.WriteAddr==0xFF)	//全部擦除
			{
				Usart_ISP_ACK(ISP_Conf);													//ISP应答---擦除完成
				Usart_ISP_Reset(ISP_Conf);												//重置编程器---恢复所有参数为默认值---模式切换后复位
				ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitErased;	//状态为擦除完成
			}
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased)	//等待擦除完成
		{
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitCommand;	//状态为擦除完成，ISP等待命令（作为从机)
		}
	}
	#else
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase)	//开始擦除
		{
			if(ISP_Conf->ISP_DATA.WriteAddr==0xFF)	//全部擦除
			{
				Usart_ISP_ACK(ISP_Conf);							//ISP应答---擦除完成
				Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitErased);	//设置从机状态--状态为擦除完成
//				ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitErased;	//状态为擦除完成
			}
		}
		
	}	
	#endif
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 Usart_ISP_GetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf)	//返回从机状态值
{	
	return(ISP_Conf->ISP_SLAVE_STATUS);		//返回从机状态值
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf,ISP_SLAVE_STATUS_TypeDef Status)	//设置从机状态
{	
	ISP_Conf->ISP_SLAVE_STATUS=Status;	//设置状态值
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Reset(ISP_Conf_TypeDef *ISP_Conf)	//重置编程器---恢复所有参数为默认值
{	
	ISP_Conf->ISP_SLAVE_STATUS			=	ISP_STATUS_IDLE;	//FLASH空闲状态，可以读写
	ISP_Conf->OverRunTime						=	0;								//超时时间
	ISP_Conf->ISP_DATA.NumToSave		=	0;		//接收到的有效数据
	ISP_Conf->ISP_DATA.NumToSend		=	0;		//需要往串口发送的数据个数
	ISP_Conf->ISP_DATA.OffsetAddr		=	0;		//写从机时的地址偏移
	ISP_Conf->ISP_DATA.StartAddr		=	0;		//起始地址
	ISP_Conf->ISP_DATA.ReadAddr			=	0;		//读数据起始地址
	ISP_Conf->ISP_DATA.ReadLen			=	0;		//需要读取的长度
	ISP_Conf->ISP_DATA.WriteAddr		=	0;		//写入数据起始地址
	ISP_Conf->ISP_DATA.WriteLen			=	0;		//需要写入的长度
	memset(ISP_Conf->ISP_DATA.ISP_RxBuffer,0xFF, ISP_BufferSize);	//接收缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_RvBuffer,0xFF, ISP_BufferSize);	//接收缓冲区--备份区
	memset(ISP_Conf->ISP_DATA.ISP_TxBuffer,0xFF, ISP_BufferSize);	//发送缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_TvBuffer,0xFF, ISP_BufferSize);	//发送缓冲区--备份区
}




